test-december-2025.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <searchHotelFares xmlns="http://tempuri.org/">
      <searchHotelFaresRQ1>
        <cityLocation code="BUE"/>
        <dateFrom>2025-12-10</dateFrom>
        <dateTo>2025-12-17</dateTo>
        <name />
        <pos>
          <id>LOZADAWS</id>
          <clave>.LOZAWS23.</clave>
        </pos>
        <rq>20350</rq>
        <currency>USD</currency>
      </searchHotelFaresRQ1>
    </searchHotelFares>
  </soap:Body>
</soap:Envelope>